vcr_cassettes/list_invoices_limit_offset.yml

---
http_interactions:
- request:
    method: get
    uri: https://sandbox.moip.com.br/v2/invoices?begin=&email=&end=&filters=&limit=10&offset=4&q=
    body:
      encoding: US-ASCII
      string: ''
    headers:
      Content-Type:
      - application/json
      Authorization:
      - OAuth 9fdc242631454d4c95d82e27b4127394_v2
      User-Agent:
      - MoipRubySDK/1.0.0 (+https://github.com/moip/moip-sdk-ruby)
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Wed, 06 Dec 2017 18:20:38 GMT
      Server:
      - Apache
      Content-Type:
      - application/json
      Content-Length:
      - '11868'
      X-Content-Type-Options:
      - nosniff
      Vary:
      - Origin
    body:
      encoding: UTF-8
      string: '{"_links":{"next":{"href":"/invoices?limit=10\u0026offset=14"},"previous":{"href":"/invoices/?limit=10\u0026offset=0"}},"summary":{"count":1667},"invoices":[{"id":"INV-D2EC2F1D7D55","amount":{"total":10000,"fees":0,"refunds":0,"liquid":0,"otherReceivers":0,"currency":"BRL","subtotals":{"shipping":0,"addition":0,"discount":0,"items":10000}},"items":[{"product":"teste
        50 emails","detail":"","price":10000}],"customer":{"email":"teste_46@moip.com.br"},"checkoutPreferences":{"fundingInstruments":{"suppressCreditCard":false,"suppressBoleto":false},"installments":[{"quantity":[1,1],"addition":0},{"quantity":[2,2],"addition":0},{"quantity":[3,3],"addition":0},{"quantity":[4,4],"addition":0},{"quantity":[5,5],"addition":0},{"quantity":[6,6],"addition":0},{"quantity":[7,7],"addition":0},{"quantity":[8,8],"addition":0},{"quantity":[9,9],"addition":0},{"quantity":[10,10],"addition":0},{"quantity":[11,11],"addition":0},{"quantity":[12,12],"addition":0}]},"status":"SENT","statusHistory":[{"status":"SENT","createdAt":"2017-12-05T17:02:24-0200"}],"createdAt":"2017-12-05T17:02:24-0200","updatedAt":"2017-12-05T17:02:24-0200","_links":{"self":{"href":"/invoice/INV-D2EC2F1D7D55"},"checkout":{"pay":{"redirectHref":"https://checkout-new-sandbox.moip.com.br?id=INV-D2EC2F1D7D55\u0026token=0d8dfdaa-cc30-4b86-8564-7c6126436280"}}}},{"id":"INV-AF36FE78CFB6","amount":{"total":10000,"fees":0,"refunds":0,"liquid":0,"otherReceivers":0,"currency":"BRL","subtotals":{"shipping":0,"addition":0,"discount":0,"items":10000}},"items":[{"product":"teste
        50 emails","detail":"","price":10000}],"customer":{"email":"teste_45@moip.com.br"},"checkoutPreferences":{"fundingInstruments":{"suppressCreditCard":false,"suppressBoleto":false},"installments":[{"quantity":[1,1],"addition":0},{"quantity":[2,2],"addition":0},{"quantity":[3,3],"addition":0},{"quantity":[4,4],"addition":0},{"quantity":[5,5],"addition":0},{"quantity":[6,6],"addition":0},{"quantity":[7,7],"addition":0},{"quantity":[8,8],"addition":0},{"quantity":[9,9],"addition":0},{"quantity":[10,10],"addition":0},{"quantity":[11,11],"addition":0},{"quantity":[12,12],"addition":0}]},"status":"SENT","statusHistory":[{"status":"SENT","createdAt":"2017-12-05T17:02:24-0200"}],"createdAt":"2017-12-05T17:02:24-0200","updatedAt":"2017-12-05T17:02:24-0200","_links":{"self":{"href":"/invoice/INV-AF36FE78CFB6"},"checkout":{"pay":{"redirectHref":"https://checkout-new-sandbox.moip.com.br?id=INV-AF36FE78CFB6\u0026token=0d549cd3-0be9-4b8a-accb-9e35e9d3a1b0"}}}},{"id":"INV-A2A09C913F27","amount":{"total":10000,"fees":0,"refunds":0,"liquid":0,"otherReceivers":0,"currency":"BRL","subtotals":{"shipping":0,"addition":0,"discount":0,"items":10000}},"items":[{"product":"teste
        50 emails","detail":"","price":10000}],"customer":{"email":"teste_44@moip.com.br"},"checkoutPreferences":{"fundingInstruments":{"suppressCreditCard":false,"suppressBoleto":false},"installments":[{"quantity":[1,1],"addition":0},{"quantity":[2,2],"addition":0},{"quantity":[3,3],"addition":0},{"quantity":[4,4],"addition":0},{"quantity":[5,5],"addition":0},{"quantity":[6,6],"addition":0},{"quantity":[7,7],"addition":0},{"quantity":[8,8],"addition":0},{"quantity":[9,9],"addition":0},{"quantity":[10,10],"addition":0},{"quantity":[11,11],"addition":0},{"quantity":[12,12],"addition":0}]},"status":"SENT","statusHistory":[{"status":"SENT","createdAt":"2017-12-05T17:02:24-0200"}],"createdAt":"2017-12-05T17:02:24-0200","updatedAt":"2017-12-05T17:02:24-0200","_links":{"self":{"href":"/invoice/INV-A2A09C913F27"},"checkout":{"pay":{"redirectHref":"https://checkout-new-sandbox.moip.com.br?id=INV-A2A09C913F27\u0026token=6de0538a-3cce-4097-98e4-f0f8b5473f98"}}}},{"id":"INV-748962EDEBC4","amount":{"total":10000,"fees":0,"refunds":0,"liquid":0,"otherReceivers":0,"currency":"BRL","subtotals":{"shipping":0,"addition":0,"discount":0,"items":10000}},"items":[{"product":"teste
        50 emails","detail":"","price":10000}],"customer":{"email":"teste_43@moip.com.br"},"checkoutPreferences":{"fundingInstruments":{"suppressCreditCard":false,"suppressBoleto":false},"installments":[{"quantity":[1,1],"addition":0},{"quantity":[2,2],"addition":0},{"quantity":[3,3],"addition":0},{"quantity":[4,4],"addition":0},{"quantity":[5,5],"addition":0},{"quantity":[6,6],"addition":0},{"quantity":[7,7],"addition":0},{"quantity":[8,8],"addition":0},{"quantity":[9,9],"addition":0},{"quantity":[10,10],"addition":0},{"quantity":[11,11],"addition":0},{"quantity":[12,12],"addition":0}]},"status":"SENT","statusHistory":[{"status":"SENT","createdAt":"2017-12-05T17:02:24-0200"}],"createdAt":"2017-12-05T17:02:24-0200","updatedAt":"2017-12-05T17:02:24-0200","_links":{"self":{"href":"/invoice/INV-748962EDEBC4"},"checkout":{"pay":{"redirectHref":"https://checkout-new-sandbox.moip.com.br?id=INV-748962EDEBC4\u0026token=675ecf43-4784-482d-b7ad-4a33cd99dd68"}}}},{"id":"INV-D82232A385FF","amount":{"total":10000,"fees":0,"refunds":0,"liquid":0,"otherReceivers":0,"currency":"BRL","subtotals":{"shipping":0,"addition":0,"discount":0,"items":10000}},"items":[{"product":"teste
        50 emails","detail":"","price":10000}],"customer":{"email":"teste_42@moip.com.br"},"checkoutPreferences":{"fundingInstruments":{"suppressCreditCard":false,"suppressBoleto":false},"installments":[{"quantity":[1,1],"addition":0},{"quantity":[2,2],"addition":0},{"quantity":[3,3],"addition":0},{"quantity":[4,4],"addition":0},{"quantity":[5,5],"addition":0},{"quantity":[6,6],"addition":0},{"quantity":[7,7],"addition":0},{"quantity":[8,8],"addition":0},{"quantity":[9,9],"addition":0},{"quantity":[10,10],"addition":0},{"quantity":[11,11],"addition":0},{"quantity":[12,12],"addition":0}]},"status":"SENT","statusHistory":[{"status":"SENT","createdAt":"2017-12-05T17:02:24-0200"}],"createdAt":"2017-12-05T17:02:24-0200","updatedAt":"2017-12-05T17:02:24-0200","_links":{"self":{"href":"/invoice/INV-D82232A385FF"},"checkout":{"pay":{"redirectHref":"https://checkout-new-sandbox.moip.com.br?id=INV-D82232A385FF\u0026token=f560a39c-61a2-438f-ab9b-3bbce72b4e74"}}}},{"id":"INV-0BB4C8718DDE","amount":{"total":10000,"fees":0,"refunds":0,"liquid":0,"otherReceivers":0,"currency":"BRL","subtotals":{"shipping":0,"addition":0,"discount":0,"items":10000}},"items":[{"product":"teste
        50 emails","detail":"","price":10000}],"customer":{"email":"teste_41@moip.com.br"},"checkoutPreferences":{"fundingInstruments":{"suppressCreditCard":false,"suppressBoleto":false},"installments":[{"quantity":[1,1],"addition":0},{"quantity":[2,2],"addition":0},{"quantity":[3,3],"addition":0},{"quantity":[4,4],"addition":0},{"quantity":[5,5],"addition":0},{"quantity":[6,6],"addition":0},{"quantity":[7,7],"addition":0},{"quantity":[8,8],"addition":0},{"quantity":[9,9],"addition":0},{"quantity":[10,10],"addition":0},{"quantity":[11,11],"addition":0},{"quantity":[12,12],"addition":0}]},"status":"SENT","statusHistory":[{"status":"SENT","createdAt":"2017-12-05T17:02:23-0200"}],"createdAt":"2017-12-05T17:02:23-0200","updatedAt":"2017-12-05T17:02:23-0200","_links":{"self":{"href":"/invoice/INV-0BB4C8718DDE"},"checkout":{"pay":{"redirectHref":"https://checkout-new-sandbox.moip.com.br?id=INV-0BB4C8718DDE\u0026token=c772c5e7-db09-44da-92f4-ee2172c47783"}}}},{"id":"INV-63DD93FF4ADA","amount":{"total":10000,"fees":0,"refunds":0,"liquid":0,"otherReceivers":0,"currency":"BRL","subtotals":{"shipping":0,"addition":0,"discount":0,"items":10000}},"items":[{"product":"teste
        50 emails","detail":"","price":10000}],"customer":{"email":"teste_40@moip.com.br"},"checkoutPreferences":{"fundingInstruments":{"suppressCreditCard":false,"suppressBoleto":false},"installments":[{"quantity":[1,1],"addition":0},{"quantity":[2,2],"addition":0},{"quantity":[3,3],"addition":0},{"quantity":[4,4],"addition":0},{"quantity":[5,5],"addition":0},{"quantity":[6,6],"addition":0},{"quantity":[7,7],"addition":0},{"quantity":[8,8],"addition":0},{"quantity":[9,9],"addition":0},{"quantity":[10,10],"addition":0},{"quantity":[11,11],"addition":0},{"quantity":[12,12],"addition":0}]},"status":"SENT","statusHistory":[{"status":"SENT","createdAt":"2017-12-05T17:02:23-0200"}],"createdAt":"2017-12-05T17:02:23-0200","updatedAt":"2017-12-05T17:02:23-0200","_links":{"self":{"href":"/invoice/INV-63DD93FF4ADA"},"checkout":{"pay":{"redirectHref":"https://checkout-new-sandbox.moip.com.br?id=INV-63DD93FF4ADA\u0026token=594b9c9c-6252-4b9f-86b3-34d94f499313"}}}},{"id":"INV-888F6C452323","amount":{"total":10000,"fees":0,"refunds":0,"liquid":0,"otherReceivers":0,"currency":"BRL","subtotals":{"shipping":0,"addition":0,"discount":0,"items":10000}},"items":[{"product":"teste
        50 emails","detail":"","price":10000}],"customer":{"email":"teste_39@moip.com.br"},"checkoutPreferences":{"fundingInstruments":{"suppressCreditCard":false,"suppressBoleto":false},"installments":[{"quantity":[1,1],"addition":0},{"quantity":[2,2],"addition":0},{"quantity":[3,3],"addition":0},{"quantity":[4,4],"addition":0},{"quantity":[5,5],"addition":0},{"quantity":[6,6],"addition":0},{"quantity":[7,7],"addition":0},{"quantity":[8,8],"addition":0},{"quantity":[9,9],"addition":0},{"quantity":[10,10],"addition":0},{"quantity":[11,11],"addition":0},{"quantity":[12,12],"addition":0}]},"status":"SENT","statusHistory":[{"status":"SENT","createdAt":"2017-12-05T17:02:23-0200"}],"createdAt":"2017-12-05T17:02:23-0200","updatedAt":"2017-12-05T17:02:23-0200","_links":{"self":{"href":"/invoice/INV-888F6C452323"},"checkout":{"pay":{"redirectHref":"https://checkout-new-sandbox.moip.com.br?id=INV-888F6C452323\u0026token=6a1b1e72-44f4-402e-8952-ad9755e4f530"}}}},{"id":"INV-C7673C42277B","amount":{"total":10000,"fees":0,"refunds":0,"liquid":0,"otherReceivers":0,"currency":"BRL","subtotals":{"shipping":0,"addition":0,"discount":0,"items":10000}},"items":[{"product":"teste
        50 emails","detail":"","price":10000}],"customer":{"email":"teste_38@moip.com.br"},"checkoutPreferences":{"fundingInstruments":{"suppressCreditCard":false,"suppressBoleto":false},"installments":[{"quantity":[1,1],"addition":0},{"quantity":[2,2],"addition":0},{"quantity":[3,3],"addition":0},{"quantity":[4,4],"addition":0},{"quantity":[5,5],"addition":0},{"quantity":[6,6],"addition":0},{"quantity":[7,7],"addition":0},{"quantity":[8,8],"addition":0},{"quantity":[9,9],"addition":0},{"quantity":[10,10],"addition":0},{"quantity":[11,11],"addition":0},{"quantity":[12,12],"addition":0}]},"status":"SENT","statusHistory":[{"status":"SENT","createdAt":"2017-12-05T17:02:23-0200"}],"createdAt":"2017-12-05T17:02:23-0200","updatedAt":"2017-12-05T17:02:23-0200","_links":{"self":{"href":"/invoice/INV-C7673C42277B"},"checkout":{"pay":{"redirectHref":"https://checkout-new-sandbox.moip.com.br?id=INV-C7673C42277B\u0026token=e9eef91e-94ce-4e83-ae56-7dc960bb1427"}}}},{"id":"INV-254DA73619A8","amount":{"total":10000,"fees":0,"refunds":0,"liquid":0,"otherReceivers":0,"currency":"BRL","subtotals":{"shipping":0,"addition":0,"discount":0,"items":10000}},"items":[{"product":"teste
        50 emails","detail":"","price":10000}],"customer":{"email":"teste_37@moip.com.br"},"checkoutPreferences":{"fundingInstruments":{"suppressCreditCard":false,"suppressBoleto":false},"installments":[{"quantity":[1,1],"addition":0},{"quantity":[2,2],"addition":0},{"quantity":[3,3],"addition":0},{"quantity":[4,4],"addition":0},{"quantity":[5,5],"addition":0},{"quantity":[6,6],"addition":0},{"quantity":[7,7],"addition":0},{"quantity":[8,8],"addition":0},{"quantity":[9,9],"addition":0},{"quantity":[10,10],"addition":0},{"quantity":[11,11],"addition":0},{"quantity":[12,12],"addition":0}]},"status":"SENT","statusHistory":[{"status":"SENT","createdAt":"2017-12-05T17:02:23-0200"}],"createdAt":"2017-12-05T17:02:23-0200","updatedAt":"2017-12-05T17:02:23-0200","_links":{"self":{"href":"/invoice/INV-254DA73619A8"},"checkout":{"pay":{"redirectHref":"https://checkout-new-sandbox.moip.com.br?id=INV-254DA73619A8\u0026token=d2108e2a-b18a-4463-807b-34a1c3af59e3"}}}}]}'
    http_version: 
  recorded_at: Wed, 06 Dec 2017 18:20:38 GMT
recorded_with: VCR 2.9.3
